---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Position
source: html/212fcfb1-2fc2-fd21-3f17-42f3b55cc455.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Position Property

The vertex's position.

## Syntax (C#)
```csharp
public XYZ Position { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null